In [ ]:
# 14 - Connect with database

In [3]:
import sqlite3
db = sqlite3.connect('IMDB.sqlite')

In [4]:
db = sqlite3.connect('School.sqlite')

In [5]:
cur = db.cursor()

In [14]:
sql_query = 'Create table Student (RollNumber int Primary key, Name Text, Age int)'

In [15]:
cur.execute(sql_query)

In [16]:
cur.execute('Insert into Student values (101,"Aman",20)')

In [17]:
db.commit()

In [ ]:
# 16 - Passing parameters in query

In [18]:
cur.execute('Insert into Student values (102,"Amit",20)')

In [19]:
db.commit()

In [1]:
db = sqlite3.connect('School.sqlite')
db.commit()

NameError: name 'sqlite3' is not defined

In [6]:
cur.execute('Insert into Student values(103,"Mohit",24)')

In [7]:
db.commit()

In [8]:
rollNumber = 104
Name = "Nikhil"
age = 34

cur.execute('Insert into Student values (?,?,?)', (rollNumber, Name, age))

In [9]:
db.commit()

In [10]:
values = [(105,"Nidhi",20),(106,"Manisha",21),(107,"Ankush",22)
    ]
cur.executemany('Insert into Student values (?,?,?)' , values)

In [11]:
db.commit()

In [12]:
cur.execute('Update Student set Age = 30')

In [13]:
db.commit()

In [15]:
cur.execute('Update Student set Age = 20 where RollNumber = 102')

In [16]:
db.commit()

In [18]:
new_age = 50
cur.execute('Update Student set Age = ? where RollNumber = 103' , (new_age,))

In [23]:
db.commit()

In [ ]:
# Fetch data

In [24]:
cur.execute('Select * from Student')

In [25]:
for row in cur:
    print(row)

(101, 'Aman', 30)
(102, 'Amit', 20)
(103, 'Mohit', 50)
(104, 'Nikhil', 30)
(105, 'Nidhi', 30)
(106, 'Manisha', 30)
(107, 'Ankush', 30)

In [26]:
cur.execute('Select * from Student')
cur.fetchone()

(101, 'Aman', 30)

In [27]:
cur.fetchone()

(102, 'Amit', 20)

In [28]:
cur.fetchmany(3)

[(103, 'Mohit', 50), (104, 'Nikhil', 30), (105, 'Nidhi', 30)]

In [29]:
cur.fetchmany()

[(106, 'Manisha', 30)]

In [31]:
cur.execute('Select * from Student')
cur.fetchall()

[(101, 'Aman', 30),
 (102, 'Amit', 20),
 (103, 'Mohit', 50),
 (104, 'Nikhil', 30),
 (105, 'Nidhi', 30),
 (106, 'Manisha', 30),
 (107, 'Ankush', 30)]

In [32]:
cur.execute('Select * from Student')
ans = cur.fetchall()
ans

[(101, 'Aman', 30),
 (102, 'Amit', 20),
 (103, 'Mohit', 50),
 (104, 'Nikhil', 30),
 (105, 'Nidhi', 30),
 (106, 'Manisha', 30),
 (107, 'Ankush', 30)]

In [34]:
cur.execute('Select * from Student where rollNumber > 103')

In [35]:
print(cur.fetchall())

[(104, 'Nikhil', 30), (105, 'Nidhi', 30), (106, 'Manisha', 30), (107, 'Ankush', 30)]

In [37]:
cur.execute('Select * from Student where name like "A%"')
print(cur.fetchall())

[(101, 'Aman', 30), (102, 'Amit', 20), (107, 'Ankush', 30)]

In [38]:
# 23 - SQLite with pandas
# import sqlite3
# import pandas as pd

[]

In [40]:
import pandas as pd
data = pd.read_sql_query("Select * from Student ", db)
data

   RollNumber     Name  Age
0         101     Aman   30
1         102     Amit   20
2         103    Mohit   50
3         104   Nikhil   30
4         105    Nidhi   30
5         106  Manisha   30
6         107   Ankush   30

In [41]:
data['Age'] == 30

0     True
1    False
2    False
3     True
4     True
5     True
6     True
Name: Age, dtype: bool

In [42]:
data[data['Age'] == 30]

   RollNumber     Name  Age
0         101     Aman   30
3         104   Nikhil   30
4         105    Nidhi   30
5         106  Manisha   30
6         107   Ankush   30

In [50]:
data = pd.DataFrame([[201,"Aman","English",20000],[202,"Komal","Maths",22000],[203,"Mahesh","Science",23000]],
columns = ["ID","Name","Course","Salary"] )
data

    ID    Name   Course  Salary
0  201    Aman  English   20000
1  202   Komal    Maths   22000
2  203  Mahesh  Science   23000

In [51]:
data.to_sql("Faculty", db)

3

In [52]:
data = pd.read_sql_query("Select * from Student ", db)
data

   RollNumber     Name  Age
0         101     Aman   30
1         102     Amit   20
2         103    Mohit   50
3         104   Nikhil   30
4         105    Nidhi   30
5         106  Manisha   30
6         107   Ankush   30

In [53]:
data["Address"] = "Test"
data

   RollNumber     Name  Age Address
0         101     Aman   30    Test
1         102     Amit   20    Test
2         103    Mohit   50    Test
3         104   Nikhil   30    Test
4         105    Nidhi   30    Test
5         106  Manisha   30    Test
6         107   Ankush   30    Test

In [54]:
data.to_sql("Student", db, if_exists = 'replace')

7